//
//  Task.swift
//  UnsplashTestTask
//
//  Created by Maks Kokos on 21.06.2022.
//


// MARK: - Test task

//Тестовое задание №3
//Стартовый экран — таббар с двумя вкладками.
//
//На первой вкладке — коллекция случайных фотографий с Unsplash. Вверху строка поиска по фотографиям с Unsplash. При нажатии на ячейку пользователь попадает на экран подробной информации.
//
//На второй вкладке — таблица со списком любимых фотографий,
//в ячейке миниатюрка фотографии и имя автора. При нажатии на ячейку — переход в экран подробной информации.
//
//Экран подробной информации содержит в себе фотографию, имя автора, дату создания, местоположение и количество скачиваний.
//
//Также экран содержит кнопку, нажатие на которую может добавить фотографию в список любимых фотографий и удалить из него. При желании можно сделать этот список редактируемым.
//
//Ссылка на API – https://unsplash.com/documentation
//
//Основные требования к заданию:
//
//Всю вёрстку приложения делайте кодом, без xib и storyboard
//Не используйте SnapKit, верстать нужно только через Auto Layout
//Не используйте SwiftUI
//Используйте как минимум одну стороннюю библиотеку Cocoa Pods (кроме Unsplash Photo Picker for iOS и прочие подобные для работы с Unsplash) 5. Должен быть как минимум один Алерт
//На задачу должно уйти до 16 часов (2 рабочих дня)
